<!DOCTYPE html>
<html>
<head>
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <title>&#1062;&#1080;&#1092;&#1088;&#1086;&#1074;&#1072;&#1103; &#1080;&#1085;&#1082;&#1083;&#1102;&#1079;&#1080;&#1103;: &#1084;&#1086;&#1081; &#1085;&#1077;&#1073;&#1086;&#1083;&#1100;&#1096;&#1086;&#1081; &#1074;&#1082;&#1083;&#1072;&#1076; &#1076;&#1083;&#1103; &#1083;&#1102;&#1076;&#1077;&#1081; &#1089; &#1088;&#1077;&#1095;&#1077;&#1074;&#1099;&#1084;&#1080; &#1080; &#1090;&#1103;&#1078;&#1077;&#1083;&#1099;&#1084;&#1080; &#1084;&#1086;&#1090;&#1086;&#1088;&#1085;&#1099;&#1084;&#1080; &#1085;&#1072;&#1088;&#1091;&#1096;&#1077;&#1085;&#1080;&#1103;&#1084;&#1080;.  &#1056;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1072; &#1085;&#1072; &#1089;&#1090;&#1099;&#1082;&#1077; &#1048;&#1048;, DIY (&#1089;&#1076;&#1077;&#1083;&#1072;&#1081; &#1089;&#1072;&#1084;)-&#1101;&#1083;&#1077;&#1082;&#1090;&#1088;&#1086;&#1085;&#1080;&#1082;&#1080; &#1080; &#1087;&#1088;&#1080;&#1082;&#1083;&#1072;&#1076;&#1085;&#1086;&#1075;&#1086; &#1055;&#1054;. - &#1056;&#1072;&#1076;&#1078;&#1072;&#1073;&#1086;&#1074; &#1040;&#1083;&#1077;&#1082;&#1089;&#1072;&#1085;&#1076;&#1088; &#1040;&#1089;&#1087;&#1072;&#1091;&#1088;&#1086;&#1074;&#1080;&#1095;</title>

    
    <link rel="stylesheet" href="assets/css/expand-macro.css">

            <meta name="scroll-content-language-key" content="">
    
    <meta name="description" content="">
<meta name="viewport" content="width=device-width, initial-scale=1.0, minimum-scale=1.0, maximum-scale=2.0, user-scalable=yes">

<script type="text/javascript" src="assets/js/jquery.min.js"></script>
<script type="text/javascript" src="assets/js/jquery.scrollTo.min.js"></script>


<script type="text/javascript" src="assets/js/translate.js"></script>

<script type="text/javascript" src="assets/js/theme.main.js"></script>

    <script type="text/javascript" src="assets/js/iframeResizer.min.js"></script>

<link rel="stylesheet" href="assets/css/content-style.css">
    <link rel="stylesheet" href="assets/css/search.css">

<link rel="stylesheet" href="assets/css/theme.main.css">
<link rel="stylesheet" href="assets/css/theme.colors.css">

            <!-- ES5 support for older browsers, needed by lunr -->
        <script src="js/augment.js"></script>
        <script id="worker" type="javascript/worker">

        startIndex = function() {
            idx = lunr.Index.load(lunrIndex);
            idx.pipeline.remove(lunr.stopWordFilter);
            postMessage({type: "setup-complete"});
        }

        onmessage = function (event) {
            var message = event.data;

            if ((message.type === 'setup') && message.baseUrl) {
                var url = message.baseUrl;
                importScripts(url + 'js/lunr.js');
                importScripts(url + 'js/lunr-extras.js');
                importScripts(url + 'js/lunr-index.js');
                importScripts(url + 'js/lunr-data.js');
                startIndex();
            }

            if (idx && (message.type === 'search-request') && message.query) {
                var searchWord = message.query;
                var results = idx.search(searchWord).map(function (result) {
                    return lunrData.filter(function (d) {
                        return d.id === parseInt(result.ref, 10)
                    })[0]
                });
                postMessage({type: 'search-results', results: results, query: searchWord, queryId: message.queryId});
            }
        }

    </script>
    </head>

<body pageid="22467087365">

<div id="ht-loader">
    <noscript>
        <p style="width: 100%; text-align:center; position: absolute; margin-top: 200px;">This content cannot be displayed without JavaScript.<br>Please enable JavaScript and reload the page.</p>
    </noscript>
</div>

<div>
   	<header id="ht-headerbar">
    <div class="ht-headerbar-left">
        <a href="" id="ht-menu-toggle" class="sp-aui-icon-small sp-aui-iconfont-appswitcher"></a>
    </div>
    <div class="ht-headerbar-right">
            <div class="sp-aui-icon-small ht-search-index-loader ht-header-icon"></div>

        <div id="ht-search">
            <div class="ht-search-input" style="display: none;">
              	<a href="#" class="sp-aui-icon-small sp-aui-iconfont-remove ht-search-clear"></a>

                <form action="#" method="GET" id="search">
                    <input class="search-input" type="text" placeholder="Search" tabindex="-1" autocomplete="off" name="q" value="">
                    <input type="hidden" name="max" value="15" />
                    <input type="submit" style="display:none" tabindex="-4"/>
                </form>

                <a href="#" id="ht-search-button" class="ht-header-icon ht-header-icon-svg">
                                        <svg width="40px" height="40px" viewBox="0 0 40 40" version="1.1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink">
                        <g>
                            <path d="M29.572,28.802 L28.801,29.571 C28.515,29.857 28.187,30 27.816,30 C27.445,30 27.116,29.857 26.831,29.571 L21.392,24.134 C20.193,24.762 18.908,25.076 17.538,25.076 C15.396,25.076 13.605,24.348 12.163,22.892 C10.721,21.436 10,19.651 10,17.538 C10,15.397 10.721,13.605 12.163,12.163 C13.605,10.721 15.396,10 17.538,10 C19.651,10 21.434,10.721 22.89,12.163 C24.347,13.605 25.075,15.397 25.075,17.538 C25.075,18.937 24.761,20.222 24.132,21.393 L29.572,26.832 C29.857,27.118 30,27.446 30,27.817 C30,28.188 29.857,28.517 29.572,28.802 L29.572,28.802 Z M13.662,21.414 C14.732,22.485 16.024,23.02 17.538,23.02 C19.051,23.02 20.343,22.485 21.413,21.414 C22.484,20.344 23.019,19.052 23.019,17.538 C23.019,16.025 22.484,14.733 21.413,13.662 C20.343,12.592 19.051,12.056 17.538,12.056 C16.024,12.056 14.732,12.592 13.662,13.662 C12.591,14.733 12.056,16.025 12.056,17.538 C12.056,19.052 12.591,20.344 13.662,21.414 L13.662,21.414 Z"></path>
                        </g>
                    </svg>
              	</a>

                <div class="ht-search-dropdown ht-dropdown">
                    <ul></ul>
                </div>
            </div>
        </div>
    </div>
    </header>   	</div>

<div id="ht-wrap-container">

            
    <div id="ht-sidebar-dragbar">
    <div class="ht-sidebar-drag-handle">
        <span class="drag-handle-1"></span>
        <span class="drag-handle-2"></span>
        <span class="drag-handle-3"></span>
    </div>
</div>
    <article id="ht-content" class="ht-content">
        <header class="ht-content-header">
                       <h1 id="src-22467087365"> <span>&#1062;&#1080;&#1092;&#1088;&#1086;&#1074;&#1072;&#1103; &#1080;&#1085;&#1082;&#1083;&#1102;&#1079;&#1080;&#1103;: &#1084;&#1086;&#1081; &#1085;&#1077;&#1073;&#1086;&#1083;&#1100;&#1096;&#1086;&#1081; &#1074;&#1082;&#1083;&#1072;&#1076; &#1076;&#1083;&#1103; &#1083;&#1102;&#1076;&#1077;&#1081; &#1089; &#1088;&#1077;&#1095;&#1077;&#1074;&#1099;&#1084;&#1080; &#1080; &#1090;&#1103;&#1078;&#1077;&#1083;&#1099;&#1084;&#1080; &#1084;&#1086;&#1090;&#1086;&#1088;&#1085;&#1099;&#1084;&#1080; &#1085;&#1072;&#1088;&#1091;&#1096;&#1077;&#1085;&#1080;&#1103;&#1084;&#1080;.  &#1056;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1072; &#1085;&#1072; &#1089;&#1090;&#1099;&#1082;&#1077; &#1048;&#1048;, DIY (&#1089;&#1076;&#1077;&#1083;&#1072;&#1081; &#1089;&#1072;&#1084;)-&#1101;&#1083;&#1077;&#1082;&#1090;&#1088;&#1086;&#1085;&#1080;&#1082;&#1080; &#1080; &#1087;&#1088;&#1080;&#1082;&#1083;&#1072;&#1076;&#1085;&#1086;&#1075;&#1086; &#1055;&#1054;.</span></h1>
        </header>

        <div id="main-content" class="wiki-content sp-grid-section" data-index-for-search="true">

    <div  class="confbox admonition admonition-note has-no-icon">
                        <div class="admonition-body">
<p   
>&#1044;&#1086;&#1073;&#1088;&#1099;&#1081; &#1076;&#1077;&#1085;&#1100;!<br/>&#1069;&#1090;&#1072; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1095;&#1082;&#1072; &#1073;&#1099;&#1083;&#1072; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1072;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1085;&#1072; &#1085;&#1077;&#1105; &#1084;&#1086;&#1078;&#1085;&#1086; &#1073;&#1099;&#1083;&#1086; &#1089;&#1086;&#1089;&#1083;&#1072;&#1090;&#1100;&#1089;&#1103; &#1074;&#1086; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1077;&#1081; &#1087;&#1091;&#1073;&#1083;&#1080;&#1082;&#1072;&#1094;&#1080;&#1080; &#1080; &#1095;&#1090;&#1086;&#1073;&#1099; &#1085;&#1077;&#1084;&#1085;&#1086;&#1075;&#1086; &#1086;&#1073;&#1086;&#1073;&#1097;&#1080;&#1090;&#1100; &#1074; &#1086;&#1076;&#1085;&#1086;&#1084; &#1084;&#1077;&#1089;&#1090;&#1077; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1077; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080;, &#1085;&#1072;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1085;&#1099;&#1077; <strong class=" ">&#1085;&#1072; &#1073;&#1077;&#1089;&#1087;&#1083;&#1072;&#1090;&#1085;&#1091;&#1102; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;</strong> &#1083;&#1102;&#1076;&#1103;&#1084;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1089;&#1090;&#1086;&#1083;&#1082;&#1085;&#1091;&#1083;&#1080;&#1089;&#1100; &#1089; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1080;&#1103;&#1084;&#1080; &#1074; &#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1080; &#1080; &#1090;&#1103;&#1078;&#1105;&#1083;&#1099;&#1084;&#1080; &#1084;&#1086;&#1090;&#1086;&#1088;&#1085;&#1099;&#1084;&#1080; &#1085;&#1072;&#1088;&#1091;&#1096;&#1077;&#1085;&#1080;&#1103;&#1084;&#1080;, &#1074;&#1082;&#1083;&#1102;&#1095;&#1072;&#1103; &#1087;&#1086;&#1083;&#1085;&#1099;&#1081; &#1087;&#1072;&#1088;&#1072;&#1083;&#1080;&#1095;.<br/>    <span style="color: #0a0a0a;">
&#1053;&#1072; &#1089;&#1083;&#1091;&#1095;&#1072;&#1081;, &#1077;&#1089;&#1083;&#1080; &#1074;&#1099; &#1079;&#1072;&#1093;&#1086;&#1090;&#1080;&#1090;&#1077; &#1087;&#1086;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100;&#1089;&#1103; &#1101;&#1090;&#1080;&#1084;&#1080; &#1076;&#1072;&#1085;&#1085;&#1099;&#1084;&#1080;, &#1103; &#1086;&#1087;&#1091;&#1073;&#1083;&#1080;&#1082;&#1086;&#1074;&#1072;&#1083; &#1082;&#1083;&#1086;&#1085; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099; &#1074; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1086;&#1081; &#1089;&#1077;&#1090;&#1080; TODO &#1042;&#1057;&#1058;&#1040;&#1042;&#1048;&#1058;&#1068; &#1057;&#1057;&#1067;&#1051;&#1054;&#1063;&#1050;&#1059;<strong class=" "><br/></strong>&#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1072;&#1103; &#1094;&#1077;&#1083;&#1100; &#1101;&#1090;&#1086;&#1081; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1095;&#1082;&#1080; &mdash; &#1095;&#1090;&#1086;&#1073;&#1099; &#1083;&#1102;&#1076;&#1080; &#1084;&#1086;&#1075;&#1083;&#1080; &#1087;&#1086;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100;&#1089;&#1103; &#1089; &#1090;&#1077;&#1084;&#1080;, &#1082;&#1090;&#1086; &#1085;&#1091;&#1078;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103;, &#1101;&#1090;&#1086;&#1081; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1077;&#1081;. <br/>&#1042;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;, &#1101;&#1090;&#1080; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1087;&#1086;&#1084;&#1086;&#1075;&#1091;&#1090; &#1082;&#1086;&#1084;&#1091;-&#1090;&#1086; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1078;&#1080;&#1079;&#1085;&#1080;. <br/>    <span style="color: #1f2328;">
&#10084;&#65039;     </span>
&#1045;&#1089;&#1083;&#1080; &#1074;&#1099; &#1079;&#1085;&#1072;&#1077;&#1090;&#1077; &#1090;&#1072;&#1082;&#1080;&#1093; &#1083;&#1102;&#1076;&#1077;&#1081;, &#1087;&#1086;&#1078;&#1072;&#1083;&#1091;&#1081;&#1089;&#1090;&#1072;, &#1087;&#1086;&#1076;&#1077;&#1083;&#1080;&#1090;&#1077;&#1089;&#1100; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1077;&#1081; &#1089; &#1085;&#1080;&#1084;&#1080;.<br/><br/>    </span>
</p>
<p   
>&#1071; &#1087;&#1088;&#1077;&#1082;&#1088;&#1072;&#1089;&#1085;&#1086; &#1087;&#1086;&#1085;&#1080;&#1084;&#1072;&#1102; &#1087;&#1086; &#1083;&#1080;&#1095;&#1085;&#1099;&#1084; &#1086;&#1073;&#1089;&#1090;&#1086;&#1103;&#1090;&#1077;&#1083;&#1100;&#1089;&#1090;&#1074;&#1072;&#1084;, &#1089; &#1082;&#1072;&#1082;&#1080;&#1084;&#1080; &#1089;&#1083;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1103;&#1084;&#1080; &#1089;&#1090;&#1072;&#1083;&#1082;&#1080;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1083;&#1102;&#1076;&#1080; &#1080; &#1080;&#1093; &#1073;&#1083;&#1080;&#1079;&#1082;&#1080;&#1077;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1089;&#1072;&#1084; &#1095;&#1077;&#1083;&#1086;&#1074;&#1077;&#1082; &#1080;&#1083;&#1080; &#1082;&#1090;&#1086;-&#1090;&#1086; &#1080;&#1079; &#1077;&#1075;&#1086; &#1073;&#1083;&#1080;&#1078;&#1072;&#1081;&#1096;&#1077;&#1075;&#1086; &#1086;&#1082;&#1088;&#1091;&#1078;&#1077;&#1085;&#1080;&#1103; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085; &#1074; &#1074;&#1086;&#1089;&#1087;&#1088;&#1080;&#1103;&#1090;&#1080;&#1080; &#1084;&#1080;&#1088;&#1072; &#1080;&#1083;&#1080; &#1080;&#1084;&#1077;&#1077;&#1090; &#1092;&#1080;&#1079;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1077; &#1086;&#1089;&#1086;&#1073;&#1077;&#1085;&#1085;&#1086;&#1089;&#1090;&#1080;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1086;&#1090;&#1088;&#1077;&#1079;&#1072;&#1102;&#1090; &#1077;&#1075;&#1086; &#1086;&#1090; &#1084;&#1085;&#1086;&#1075;&#1080;&#1093; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1077;&#1081;.</p>
<p   
>&#1042; &#1101;&#1090;&#1086;&#1090; &#1088;&#1072;&#1079; &#1103; &#1093;&#1086;&#1095;&#1091; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077; <strong class=" ">&#1089;&#1092;&#1086;&#1082;&#1091;&#1089;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1085;&#1072; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1077; AbleMouse</strong>, &#1076;&#1072;&#1102;&#1097;&#1077;&#1084; &#1094;&#1080;&#1092;&#1088;&#1086;&#1074;&#1091;&#1102; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1091; &#1083;&#1102;&#1076;&#1103;&#1084; &#1089; &#1086;&#1095;&#1077;&#1085;&#1100; &#1089;&#1077;&#1088;&#1100;&#1105;&#1079;&#1085;&#1099;&#1084;&#1080; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1080;&#1103;&#1084;&#1080;, <strong class=" ">&#1074;&#1082;&#1083;&#1102;&#1095;&#1072;&#1103; &#1087;&#1072;&#1088;&#1072;&#1083;&#1080;&#1095; &#1090;&#1077;&#1083;&#1072; &#1080; &#1075;&#1086;&#1083;&#1086;&#1074;&#1099;</strong>,<br/><strong class=" ">&#1080; &#1085;&#1077;&#1084;&#1085;&#1086;&#1075;&#1086; &#1074;&#1089;&#1087;&#1086;&#1084;&#1085;&#1080;&#1090;&#1100;</strong> &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1091; <strong class=" ">telegram-&#1073;&#1086;&#1090; &#1050;&#1086;&#1089;&#1090;&#1103;</strong>, &#1086; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1081; &#1091;&#1078;&#1077; &#1087;&#1080;&#1089;&#1072;&#1083;&#1080; &#1074; &quot;&#1044;&#1086;&#1073;&#1088;&#1086;&#1084; &#1059;&#1090;&#1088;&#1077;&quot;.</p>
<p   
>&#1058;&#1072;&#1082; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1083;&#1086;&#1089;&#1100;, &#1095;&#1090;&#1086; &#1084;&#1086;&#1081; &#1085;&#1077;&#1073;&#1086;&#1083;&#1100;&#1096;&#1086;&#1081; &#1074;&#1082;&#1083;&#1072;&#1076; &#1085;&#1072;&#1095;&#1072;&#1083;&#1089;&#1103; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1080; &#1086;&#1076;&#1085;&#1086;&#1084;&#1091; &#1095;&#1077;&#1083;&#1086;&#1074;&#1077;&#1082;&#1091;,     <span style="color: #0a0a0a;">
&#1085;&#1086; &#1073;&#1083;&#1072;&#1075;&#1086;&#1076;&#1072;&#1088;&#1103; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1082;&#1077; &#1080; &#1091;&#1095;&#1072;&#1089;&#1090;&#1080;&#1102; &#1084;&#1085;&#1086;&#1075;&#1080;&#1093; &#1083;&#1102;&#1076;&#1077;&#1081; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090; &#1084;&#1072;&#1089;&#1096;&#1090;&#1072;&#1073;&#1080;&#1088;&#1086;&#1074;&#1072;&#1083;&#1089;&#1103;, &#1080;     </span>
&#1087;&#1086;&#1084;&#1086;&#1097;&#1100; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1083;&#1080; &#1075;&#1086;&#1088;&#1072;&#1079;&#1076;&#1086; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077; &#1083;&#1102;&#1076;&#1077;&#1081;</p>
        </div>
    </div>
<p   
><br/><br/><br/><strong class=" ">&#1050;&#1088;&#1072;&#1090;&#1082;&#1086;&#1077; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077;</strong><br/></p>
<ul class="toc-indentation "><li class=" "><p   
><a   href="#src-22467087365_safe-id-aWQt0KbQuNGE0YDQvtCy0LDRj9C40L3QutC70Y7Qt9C40Y860LzQvtC50L3QtdCx0L7Qu9GM0YjQvtC50LLQutC70LDQtNC00LvRj9C70Y7QtNC10LnRgdGA0LXRh9C10LLRi9C80LjQuNGC0Y_QttC10LvRi9C80LjQvNC-0YLQvtGA0L3Ri9C80LjQvdCw0YDRg9GI0LXQvdC40Y_QvNC4LtCg0LDQt9GA0LDQsdC-0YLQutCw0L3QsNGB0YLRi9C60LXQmNCYLERJWSjRgdC00LXQu9Cw0LnRgdCw0Lwp0Y3Qu9C10LrRgtGA0L7QvdC40LrQuNC40L_RgNC40LrQu9Cw0LTQvdC-0LPQvtCf0J4uLdCi0LXQu9C10LPRgNCw0Lwt0LHQvtGCItCa0L7RgdGC0Y8i0LjQmNCYLdGA0LXRiNC10L3QuNGPKNCw0LLQsNGC0LDRgNGLLi4pLNC60L7RgtC-0YDRi9C10YDQvtC00LjQu9C40YHRjNCx0LvQsNCz0L7QtNCw0YDRj9GA0LDQsdC-0YLQtdC90LDQtNGN0YLQuNC80L_RgNC-0LTRg9C60YLQvtC8">&#1058;&#1077;&#1083;&#1077;&#1075;&#1088;&#1072;&#1084;-&#1073;&#1086;&#1090; &quot;&#1050;&#1086;&#1089;&#1090;&#1103;&quot; &#1080; &#1048;&#1048;-&#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1103; (&#1072;&#1074;&#1072;&#1090;&#1072;&#1088;&#1099; ..), &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1088;&#1086;&#1076;&#1080;&#1083;&#1080;&#1089;&#1100; &#1073;&#1083;&#1072;&#1075;&#1086;&#1076;&#1072;&#1088;&#1103; &#1088;&#1072;&#1073;&#1086;&#1090;&#1077; &#1085;&#1072;&#1076; &#1101;&#1090;&#1080;&#1084; &#1087;&#1088;&#1086;&#1076;&#1091;&#1082;&#1090;&#1086;&#1084;</a></p>
</li><li class=" "><p   
><a   href="#src-22467087365_safe-id-aWQt0KbQuNGE0YDQvtCy0LDRj9C40L3QutC70Y7Qt9C40Y860LzQvtC50L3QtdCx0L7Qu9GM0YjQvtC50LLQutC70LDQtNC00LvRj9C70Y7QtNC10LnRgdGA0LXRh9C10LLRi9C80LjQuNGC0Y_QttC10LvRi9C80LjQvNC-0YLQvtGA0L3Ri9C80LjQvdCw0YDRg9GI0LXQvdC40Y_QvNC4LtCg0LDQt9GA0LDQsdC-0YLQutCw0L3QsNGB0YLRi9C60LXQmNCYLERJWSjRgdC00LXQu9Cw0LnRgdCw0Lwp0Y3Qu9C10LrRgtGA0L7QvdC40LrQuNC40L_RgNC40LrQu9Cw0LTQvdC-0LPQvtCf0J4uLUFibGVNb3VzZS3RgNC10YjQtdC90LjRj9C80L_QvtGD0L_RgNCw0LLQu9C10L3QuNGO0LzRi9GI0YzRjtC40LrQvtC80L_RjNGO0YLQtdGA0L7QvNC00LvRj9C70Y7QtNC10LnRgdGC0Y_QttGR0LvRi9C80LjRhNC40LfQuNGH0LXRgdC60LjQvNC40L7Qs9GA0LDQvdC40YfQtdC90LjRj9C80Lgs0L3QsNC_0YDQuNC80LXRgCzQv9Cw0YDQsNC70LjRh9GC0LXQu9Cw0Lg">AbleMouse - &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1103;&#1084; &#1087;&#1086; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1102; &#1084;&#1099;&#1096;&#1100;&#1102; &#1080; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1086;&#1084; &#1076;&#1083;&#1103; &#1083;&#1102;&#1076;&#1077;&#1081; &#1089; &#1090;&#1103;&#1078;&#1105;&#1083;&#1099;&#1084;&#1080; &#1092;&#1080;&#1079;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1084;&#1080; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1080;&#1103;&#1084;&#1080;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1087;&#1072;&#1088;&#1072;&#1083;&#1080;&#1095; &#1090;&#1077;&#1083;&#1072; &#1080; &#1075;&#1086;&#1083;&#1086;&#1074;&#1099;.</a></p>
<ul class="toc-indentation "><li class=" "><p   
><a   href="#src-22467087365_safe-id-aWQt0KbQuNGE0YDQvtCy0LDRj9C40L3QutC70Y7Qt9C40Y860LzQvtC50L3QtdCx0L7Qu9GM0YjQvtC50LLQutC70LDQtNC00LvRj9C70Y7QtNC10LnRgdGA0LXRh9C10LLRi9C80LjQuNGC0Y_QttC10LvRi9C80LjQvNC-0YLQvtGA0L3Ri9C80LjQvdCw0YDRg9GI0LXQvdC40Y_QvNC4LtCg0LDQt9GA0LDQsdC-0YLQutCw0L3QsNGB0YLRi9C60LXQmNCYLERJWSjRgdC00LXQu9Cw0LnRgdCw0Lwp0Y3Qu9C10LrRgtGA0L7QvdC40LrQuNC40L_RgNC40LrQu9Cw0LTQvdC-0LPQvtCf0J4uLdCi0LDQsdC70LjRhtCw0L_RgNC-0LTRg9C60YLQvtCyQWJsZU1vdXNl">&#1058;&#1072;&#1073;&#1083;&#1080;&#1094;&#1072; &#1087;&#1088;&#1086;&#1076;&#1091;&#1082;&#1090;&#1086;&#1074; AbleMouse</a></p>
</li></ul></li></ul><p   
><br/></p>
<p   
></p>
    <div class="section section-1" id="src-22467087365_safe-id-aWQt0KbQuNGE0YDQvtCy0LDRj9C40L3QutC70Y7Qt9C40Y860LzQvtC50L3QtdCx0L7Qu9GM0YjQvtC50LLQutC70LDQtNC00LvRj9C70Y7QtNC10LnRgdGA0LXRh9C10LLRi9C80LjQuNGC0Y_QttC10LvRi9C80LjQvNC-0YLQvtGA0L3Ri9C80LjQvdCw0YDRg9GI0LXQvdC40Y_QvNC4LtCg0LDQt9GA0LDQsdC-0YLQutCw0L3QsNGB0YLRi9C60LXQmNCYLERJWSjRgdC00LXQu9Cw0LnRgdCw0Lwp0Y3Qu9C10LrRgtGA0L7QvdC40LrQuNC40L_RgNC40LrQu9Cw0LTQvdC-0LPQvtCf0J4uLdCi0LXQu9C10LPRgNCw0Lwt0LHQvtGCItCa0L7RgdGC0Y8i0LjQmNCYLdGA0LXRiNC10L3QuNGPKNCw0LLQsNGC0LDRgNGLLi4pLNC60L7RgtC-0YDRi9C10YDQvtC00LjQu9C40YHRjNCx0LvQsNCz0L7QtNCw0YDRj9GA0LDQsdC-0YLQtdC90LDQtNGN0YLQuNC80L_RgNC-0LTRg9C60YLQvtC8">
        <h1 class="heading "><span>&#1058;&#1077;&#1083;&#1077;&#1075;&#1088;&#1072;&#1084;-&#1073;&#1086;&#1090; &quot;&#1050;&#1086;&#1089;&#1090;&#1103;&quot; &#1080; &#1048;&#1048;-&#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1103; (&#1072;&#1074;&#1072;&#1090;&#1072;&#1088;&#1099; ..), &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1088;&#1086;&#1076;&#1080;&#1083;&#1080;&#1089;&#1100; &#1073;&#1083;&#1072;&#1075;&#1086;&#1076;&#1072;&#1088;&#1103; &#1088;&#1072;&#1073;&#1086;&#1090;&#1077; &#1085;&#1072;&#1076; &#1101;&#1090;&#1080;&#1084; &#1087;&#1088;&#1086;&#1076;&#1091;&#1082;&#1090;&#1086;&#1084;</span></h1>
<p   
>&#1042;&#1089;&#1105; &#1085;&#1072;&#1095;&#1072;&#1083;&#1086;&#1089;&#1100; &#1089; &#1090;&#1077;&#1083;&#1077;&#1075;&#1088;&#1072;&#1084;-&#1073;&#1086;&#1090;&#1072; &quot;&#1050;&#1086;&#1089;&#1090;&#1103;&quot;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1083; &#1087;&#1088;&#1086;&#1089;&#1090;&#1091;&#1102; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1102; &mdash; &#1087;&#1086;&#1084;&#1086;&#1075;&#1072;&#1083; &#1090;&#1077;&#1084;, &#1082;&#1090;&#1086; &#1085;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090; &#1075;&#1086;&#1074;&#1086;&#1088;&#1080;&#1090;&#1100;, &#1086;&#1079;&#1074;&#1091;&#1095;&#1080;&#1074;&#1072;&#1090;&#1100; &#1090;&#1077;&#1082;&#1089;&#1090; &#1085;&#1072;&#1073;&#1088;&#1072;&#1085;&#1085;&#1099;&#1093; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1081; &#1074; &#1084;&#1086;&#1084;&#1077;&#1085;&#1090;&#1077;, &#1075;&#1086;&#1090;&#1086;&#1074;&#1080;&#1090;&#1100; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1099;&#1077; &#1072;&#1091;&#1076;&#1080;&#1086;&#1086;&#1073;&#1088;&#1072;&#1079;&#1094;&#1099; &#1079;&#1072;&#1088;&#1072;&#1085;&#1077;&#1077;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1087;&#1077;&#1088;&#1077;&#1076; &#1087;&#1086;&#1093;&#1086;&#1076;&#1086;&#1084; &#1082; &#1074;&#1088;&#1072;&#1095;&#1091; &#1080; &#1074; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1089;&#1083;&#1091;&#1095;&#1072;&#1103;&#1093; &quot;&#1088;&#1072;&#1079;&#1075;&#1086;&#1074;&#1072;&#1088;&#1080;&#1074;&#1072;&#1090;&#1100;&quot; &#1082;&#1083;&#1086;&#1085;&#1072;&#1084;&#1080; &#1089;&#1074;&#1086;&#1080;&#1093; &#1075;&#1086;&#1083;&#1086;&#1089;&#1086;&#1074;    <span style="color: #0a0a0a;">
. &#1056;&#1077;&#1095;&#1100; &#1085;&#1077; &#1086;     </span>
&#1084;&#1072;&#1089;&#1089;&#1086;&#1074;&#1099;&#1093; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1089;&#1077;&#1088;&#1074;&#1080;&#1089;&#1072;&#1093;    <span style="color: #0a0a0a;">
, &#1072; &#1086; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086; &#1089;&#1086;&#1073;&#1088;&#1072;&#1085;&#1085;&#1099;&#1093; &#1074;&#1088;&#1091;&#1095;&#1085;&#1091;&#1102; &#1084;&#1086;&#1076;&#1077;&#1083;&#1103;&#1093;, &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1103;&#1102;&#1097;&#1080;&#1093; &#1078;&#1080;&#1074;&#1091;&#1102; &#1080;&#1085;&#1076;&#1080;&#1074;&#1080;&#1076;&#1091;&#1072;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1100;    </span>
.<br/>    <span style="color: #0a0a0a;">
&#1042;&#1089;&#1102; &#1073;&#1072;&#1079;&#1086;&#1074;&#1091;&#1102; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1102; &#1084;&#1086;&#1078;&#1085;&#1086; &#1087;&#1086;&#1095;&#1080;&#1090;&#1072;&#1090;&#1100; &#1074; &#1089;&#1087;&#1077;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1086;&#1084;     </span>
&#1090;&#1077;&#1083;&#1077;&#1075;&#1088;&#1072;&#1084;-&#1082;&#1072;&#1085;&#1072;&#1083;&#1077;<strong class="Yjhzub ">     <span style="color: #0a0a0a;">
<a  class="external-link" href="https://t.me/f1KostyaBot/6">https://t.me/f1KostyaBot/</a>    </span>
, </strong>&#1087;&#1086;&#1089;&#1074;&#1103;&#1097;&#1077;&#1085;&#1085;&#1086;&#1084;    <span style="color: #0a0a0a;">
 &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1082;&#1077; &#1073;&#1086;&#1090;&#1072;. <br/>&#1042;&#1086;&#1090; &#1089;&#1089;&#1099;&#1083;&#1086;&#1095;&#1082;&#1072; &#1085;&#1072; &#1087;&#1086;&#1089;&#1090; &#1074; &#1090;&#1077;&#1083;&#1077;&#1075;&#1088;&#1072;&#1084; <a  class="external-link" href="https://t.me/f1KostyaBot/6">https://t.me/f1KostyaBot/6</a>, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1084; &#1089;&#1086;&#1073;&#1088;&#1072;&#1085;&#1072; &#1087;&#1086;&#1083;&#1077;&#1079;&#1085;&#1072;&#1103; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1103;: &#1089;&#1089;&#1099;&#1083;&#1082;&#1072; &#1085;&#1072; &#1073;&#1086;&#1090;, &#1088;&#1091;&#1082;&#1086;&#1074;&#1086;&#1076;&#1089;&#1090;&#1074;&#1086; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103;, &#1080;&#1089;&#1090;&#1086;&#1088;&#1080;&#1103;...<br/>    <span style="color: #1f2328;">
&#10084;&#65039;     </span>
&#1061;&#1086;&#1095;&#1091; &#1077;&#1097;&#1105; &#1088;&#1072;&#1079; &#1089;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1089;&#1087;&#1072;&#1089;&#1080;&#1073;&#1086; &#1074;&#1089;&#1077;&#1084;, &#1082;&#1090;&#1086; &#1087;&#1086;&#1084;&#1086;&#1075;&#1072;&#1083; &#1088;&#1072;&#1089;&#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1103;&#1090;&#1100; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1102;, &#1087;&#1086;&#1084;&#1086;&#1075;&#1072;&#1083; &#1075;&#1086;&#1090;&#1086;&#1074;&#1080;&#1090;&#1100; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077; &#1076;&#1083;&#1103; &#1086;&#1073;&#1091;&#1095;&#1077;&#1085;&#1080;&#1103; &#1084;&#1086;&#1076;&#1077;&#1083;&#1077;&#1081; &#1080; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1083; &#1089;&#1083;&#1086;&#1074;&#1086;&#1084;.<br/>    </span>
<br/><strong class=" ">&#1053;&#1072; &#1076;&#1072;&#1085;&#1085;&#1099;&#1081; &#1084;&#1086;&#1084;&#1077;&#1085;&#1090; &#1095;&#1077;&#1088;&#1077;&#1079; &#1073;&#1086;&#1090;&#1072; &#1073;&#1099;&#1083;&#1086; &#1086;&#1079;&#1074;&#1091;&#1095;&#1077;&#1085;&#1086; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077; 1 &#1084;&#1080;&#1083;&#1083;&#1080;&#1086;&#1085;&#1072; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1081;, &#1080; &#1074; &#1089;&#1088;&#1077;&#1076;&#1085;&#1077;&#1084; &#1085;&#1072; &#1087;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1085;&#1086;&#1081; &#1086;&#1089;&#1085;&#1086;&#1074;&#1077; &#1080;&#1084; &#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1090;&#1089;&#1103; 130 &#1095;&#1077;&#1083;&#1086;&#1074;&#1077;&#1082;. <br/>&#1050;&#1086;&#1085;&#1077;&#1095;&#1085;&#1086;, &#1089; &#1090;&#1086;&#1095;&#1082;&#1080; &#1079;&#1088;&#1077;&#1085;&#1080;&#1103; IT &#1101;&#1090;&#1086; &#1085;&#1077; &#1073;&#1086;&#1083;&#1100;&#1096;&#1086;&#1081; &quot;&#1090;&#1088;&#1072;&#1092;&#1080;&#1082;&quot;, &#1085;&#1086; &#1074; &#1095;&#1077;&#1083;&#1086;&#1074;&#1077;&#1095;&#1077;&#1089;&#1082;&#1086;&#1084; &#1087;&#1083;&#1072;&#1085;&#1077; &#1101;&#1090;&#1086; &#1085;&#1077; &#1080;&#1084;&#1077;&#1077;&#1090; &#1094;&#1077;&#1085;&#1099;.</strong><br/><br/>    <span style="color: #0a0a0a;">
&#1069;&#1090;&#1086;&#1090; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1080;&#1083; &#1084;&#1085;&#1077;, &#1087;&#1086;&#1084;&#1080;&#1084;&#1086; &#1084;&#1086;&#1088;&#1072;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086; &#1091;&#1076;&#1086;&#1074;&#1083;&#1077;&#1090;&#1074;&#1086;&#1088;&#1077;&#1085;&#1080;&#1103;     </span>
&#1080;    <span style="color: #0a0a0a;">
 &#1079;&#1085;&#1072;&#1082;&#1086;&#1084;&#1089;&#1090;&#1074;&#1072; &#1089; &#1087;&#1086;&#1090;&#1088;&#1103;&#1089;&#1072;&#1102;&#1097;&#1080;&#1084;&#1080; &#1083;&#1102;&#1076;&#1100;&#1084;&#1080;, &#1077;&#1097;&#1105; &#1080; &#1089;&#1080;&#1083;&#1100;&#1085;&#1086; &#1074;&#1099;&#1088;&#1072;&#1089;&#1090;&#1080; &#1090;&#1077;&#1093;&#1085;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; <br/>&#1080; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100; &#129504; <strong class=" ">&#1089;&#1074;&#1086;&#1080;</strong> <strong class=" ">&#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1103;</strong> &#1087;&#1086; &#128161;     </span>
<strong class=" ">&#1082;&#1083;&#1086;&#1085;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1102;</strong> &#1075;&#1086;&#1083;&#1086;&#1089;&#1072;    <span style="color: #0a0a0a;">
 &#1080; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1102; &#128161; <strong class=" ">&#1094;&#1080;&#1092;&#1088;&#1086;&#1074;&#1099;&#1093; &#1072;&#1074;&#1072;&#1090;&#1072;&#1088;&#1086;&#1074;</strong> &#1089; &#1089;&#1080;&#1085;&#1093;&#1088;&#1086;&#1085;&#1080;&#1079;&#1072;&#1094;&#1080;&#1077;&#1081; &#1075;&#1091;&#1073;, &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1102;&#1097;&#1080;&#1093; &#1074; &#1088;&#1077;&#1072;&#1083;&#1100;&#1085;&#1086;&#1084; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1080; &#1076;&#1072;&#1078;&#1077; &#1073;&#1077;&#1079; &#1075;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1091;&#1089;&#1082;&#1086;&#1088;&#1080;&#1090;&#1077;&#1083;&#1077;&#1081;, &#1087;&#1088;&#1080; &#1101;&#1090;&#1086;&#1084; &#1074;&#1072;&#1084; &#1085;&#1077; &#1085;&#1091;&#1078;&#1085;&#1086; &#1078;&#1076;&#1072;&#1090;&#1100; &#1086;&#1082;&#1086;&#1085;&#1095;&#1072;&#1085;&#1080;&#1103; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080;: &#1072;&#1074;&#1072;&#1090;&#1072;&#1088; &quot;&#1086;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090;&quot; &#1089;&#1088;&#1072;&#1079;&#1091;, &#1076;&#1072;&#1078;&#1077; &#1077;&#1089;&#1083;&#1080; &#1077;&#1084;&#1091; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1086;&#1080;&#1090; &#1086;&#1079;&#1074;&#1091;&#1095;&#1080;&#1090;&#1100; &#1095;&#1072;&#1089;&#1086;&#1074;&#1091;&#1102; &#1083;&#1077;&#1082;&#1094;&#1080;&#1102;. <br/><br/>&#1069;&#1090;&#1086; &#1085;&#1072;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1088;&#1072;&#1079;&#1074;&#1080;&#1074;&#1072;&#1083;&#1086;&#1089;&#1100; &#1087;&#1086; &#1076;&#1074;&#1091;&#1084; &#1087;&#1088;&#1080;&#1095;&#1080;&#1085;&#1072;&#1084;. &#1055;&#1077;&#1088;&#1074;&#1072;&#1103; &mdash; &#1083;&#1102;&#1076;&#1103;&#1084; &#1075;&#1086;&#1088;&#1072;&#1079;&#1076;&#1086; &#1082;&#1086;&#1084;&#1092;&#1086;&#1088;&#1090;&#1085;&#1077;&#1077; &quot;&#1075;&#1086;&#1074;&#1086;&#1088;&#1080;&#1090;&#1100;&quot; &#1089;&#1074;&#1086;&#1080;&#1084; &#1075;&#1086;&#1083;&#1086;&#1089;&#1086;&#1084;, &#1080; &#1090;&#1077;, &#1082;&#1090;&#1086; &#1080;&#1093; &#1088;&#1072;&#1085;&#1100;&#1096;&#1077; &#1079;&#1085;&#1072;&#1083;, &#1090;&#1086;&#1078;&#1077; &#1083;&#1091;&#1095;&#1096;&#1077; &#1080;&#1093; &#1074;&#1086;&#1089;&#1087;&#1088;&#1080;&#1085;&#1080;&#1084;&#1072;&#1102;&#1090; &#1074; &#1101;&#1090;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;. &#1040;&#1074;&#1072;&#1090;&#1072;&#1088;&#1099; &#1087;&#1086;&#1084;&#1086;&#1075;&#1072;&#1102;&#1090; &#1074; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;, &#1077;&#1089;&#1083;&#1080; &#1091; &#1095;&#1077;&#1083;&#1086;&#1074;&#1077;&#1082;&#1072;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1091;&#1078;&#1077; &#1085;&#1077;&#1080;&#1089;&#1087;&#1088;&#1072;&#1074;&#1080;&#1084;&#1072;&#1103; &#1090;&#1088;&#1072;&#1074;&#1084;&#1072; &#1083;&#1080;&#1094;&#1072;, &#1080; &#1077;&#1084;&#1091; &#1093;&#1086;&#1095;&#1077;&#1090;&#1089;&#1103; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1100; &#1074; &#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1080; &#1089;&#1074;&#1086;&#1102; &#1094;&#1080;&#1092;&#1088;&#1086;&#1074;&#1091;&#1102; &#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1095;&#1085;&#1086;&#1089;&#1090;&#1100;. <br/>&#1058;&#1072;&#1082;&#1078;&#1077; &#1101;&#1090;&#1086;&#1090; &#1082;&#1086;&#1076; &#1084;&#1086;&#1078;&#1077;&#1090; &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1103;&#1090;&#1100;&#1089;&#1103; &#1074; &#1088;&#1086;&#1073;&#1086;&#1090;&#1086;&#1090;&#1077;&#1093;&#1085;&#1080;&#1082;&#1077; (&#1082;&#1072;&#1082; &#1083;&#1080;&#1094;&#1086; &#1088;&#1086;&#1073;&#1086;&#1090;&#1072;) &#1080;&#1083;&#1080; &#1076;&#1083;&#1103; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1099;&#1093; &#1072;&#1089;&#1089;&#1080;&#1089;&#1090;&#1077;&#1085;&#1090;&#1086;&#1074; &#1080; media &#1082;&#1086;&#1085;&#1090;&#1077;&#1085;&#1090;&#1072;.     </span>
&#1042;&#1086;&#1090; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1086;&#1074; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080;:<br/>&#1042;&#1089;&#1103; &#1075;&#1077;&#1085;&#1077;&#1088;&#1072;&#1094;&#1080;&#1103; &#1074;&#1080;&#1076;&#1077;&#1086; &#1087;&#1088;&#1086;&#1080;&#1089;&#1093;&#1086;&#1076;&#1080;&#1090; &#1083;&#1086;&#1082;&#1072;&#1083;&#1100;&#1085;&#1086; &#1085;&#1072; &#1084;&#1086;&#1077;&#1084; &#1085;&#1086;&#1091;&#1090;&#1073;&#1091;&#1082;&#1077;.<br/>&#1042; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1096;&#1072;&#1073;&#1083;&#1086;&#1085;&#1072; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1086; &#1087;&#1088;&#1072;&#1082;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1083;&#1102;&#1073;&#1086;&#1077; &#1074;&#1080;&#1076;&#1077;&#1086; &#1089; &#1095;&#1077;&#1083;&#1086;&#1074;&#1077;&#1082;&#1086;&#1084; &#1080;&#1083;&#1080; &#1072;&#1085;&#1080;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1084; &#1087;&#1077;&#1088;&#1089;&#1086;&#1085;&#1072;&#1078;&#1077;&#1084;.</p>
<p  class="ds-markdown-paragraph" 
>&#1055;&#1088;&#1080;&#1084;&#1077;&#1088;&#1099;. &#1051;&#1086;&#1082;&#1072;&#1083;&#1100;&#1085;&#1072;&#1103; &#1075;&#1077;&#1085;&#1077;&#1088;&#1072;&#1094;&#1080;&#1103; &#1085;&#1072; &#1085;&#1086;&#1091;&#1090;&#1073;&#1091;&#1082;&#1077;:</p>
<ol class=" "><li class=" "><p  class="ds-markdown-paragraph" 
><a  class="external-link" href="https://rutube.ru/shorts/037a51ea31eedc499be3f15fd733399e/">&#127916; Rutube</a><strong class=" "> </strong>&#1044;&#1080;&#1072;&#1083;&#1086;&#1075; &#1089; &#1072;&#1074;&#1072;&#1090;&#1072;&#1088;&#1072;&#1084;&#1080; (&#1086;&#1073;&#1089;&#1091;&#1078;&#1076;&#1077;&#1085;&#1080;&#1077; &#1089;&#1082;&#1072;&#1079;&#1082;&#1080; &laquo;&#1047;&#1086;&#1083;&#1091;&#1096;&#1082;&#1080;&raquo;), &#1089;&#1086;&#1079;&#1076;&#1072;&#1074;&#1072;&#1077;&#1084;&#1099;&#1084;&#1080; &#1073;&#1077;&#1079; &#1079;&#1072;&#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; GPU.</p>
</li><li class=" "><p  class="ds-markdown-paragraph" 
><a  class="external-link" href="https://rutube.ru/shorts/0f44a328881bc3b34a59c51541ea371e/">&#127916; Rutube</a> &#1052;&#1075;&#1085;&#1086;&#1074;&#1077;&#1085;&#1085;&#1072;&#1103; &#1075;&#1077;&#1085;&#1077;&#1088;&#1072;&#1094;&#1080;&#1103; &#1072;&#1074;&#1072;&#1090;&#1072;&#1088;&#1086;&#1074; &#1089; &#1090;&#1086;&#1095;&#1085;&#1086;&#1081; &#1089;&#1080;&#1085;&#1093;&#1088;&#1086;&#1085;&#1080;&#1079;&#1072;&#1094;&#1080;&#1077;&#1081; &#1075;&#1091;&#1073;, &#1085;&#1077; &#1079;&#1072;&#1074;&#1080;&#1089;&#1103;&#1097;&#1072;&#1103; &#1086;&#1090; &#1076;&#1083;&#1080;&#1085;&#1099; &#1072;&#1091;&#1076;&#1080;&#1086;.</p>
</li><li class=" "><p  class="ds-markdown-paragraph" 
><a  class="external-link" href="https://rutube.ru/shorts/a867989f75f2b6896463ce716f5e2bdc/">&#127916; Rutube</a> &#1053;&#1072;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; &#1092;&#1080;&#1083;&#1100;&#1090;&#1088;&#1086;&#1074; &#1080; &#1101;&#1092;&#1092;&#1077;&#1082;&#1090;&#1086;&#1074; &#1074; &#1088;&#1077;&#1072;&#1083;&#1100;&#1085;&#1086;&#1084; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1080;.</p>
</li></ol><p   
>&#1087;&#1088;&#1086; &#1073;&#1083;&#1086;&#1082;&#1080;&#1088;&#1086;&#1074;&#1082;&#1080; &#1090;&#1077;&#1083;&#1077;&#1075;&#1088;&#1072;&#1084; &#1080; &#1074;&#1083;&#1080;&#1103;&#1085;&#1080;&#1077; &#1085;&#1072; &#1073;&#1086;&#1090;&#1072; &#1050;&#1086;&#1089;&#1090;&#1103;</p>
<p   
>    <span style="color: #1f2328;">
&#1055;&#1088;&#1086;&#1089;&#1090;&#1086; &#1076;&#1083;&#1103; &#1087;&#1086;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1103;: &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1085;&#1086; &#1089; &#1086;&#1082;&#1090;&#1103;&#1073;&#1088;&#1103; 2025 &#1075;&#1086;&#1076;&#1072; (&#1093;&#1086;&#1090;&#1100; &#1101;&#1090;&#1086; &#1103;&#1074;&#1085;&#1086; &#1080; &#1085;&#1077; &#1086;&#1079;&#1074;&#1091;&#1095;&#1080;&#1074;&#1072;&#1083;&#1086;&#1089;&#1100;, &#1080; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1089;&#1077;&#1081;&#1095;&#1072;&#1089; &#1080;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1090;&#1080;&#1087;&#1072; &#1058;&#1040;&#1057;&#1057; &#1085;&#1072;&#1095;&#1072;&#1083;&#1080; &#1076;&#1072;&#1074;&#1072;&#1090;&#1100; &#1082;&#1086;&#1084;&#1084;&#1077;&#1085;&#1090;&#1072;&#1088;&#1080;&#1080; &#1095;&#1080;&#1085;&#1086;&#1074;&#1085;&#1080;&#1082;&#1086;&#1074;) &#1090;&#1088;&#1072;&#1092;&#1080;&#1082; Telegram &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1080;&#1074;&#1072;&#1083;&#1089;&#1103;. &#1044;&#1083;&#1103; &#1073;&#1086;&#1090;&#1072; &#1101;&#1090;&#1086; &#1074;&#1099;&#1088;&#1072;&#1078;&#1072;&#1083;&#1086;&#1089;&#1100; &#1074; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086; &#1095;&#1072;&#1089;&#1090;&#1100; &#1072;&#1091;&#1076;&#1080;&#1086;&#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1081; &#1087;&#1088;&#1086;&#1093;&#1086;&#1076;&#1080;&#1083;&#1072;, &#1072; &#1095;&#1072;&#1089;&#1090;&#1100; &mdash; &laquo;&#1079;&#1072;&#1089;&#1090;&#1088;&#1077;&#1074;&#1072;&#1083;&#1072;&raquo;. &#1054;&#1089;&#1086;&#1073;&#1077;&#1085;&#1085;&#1086; &#1076;&#1083;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1087;&#1077;&#1088;&#1080;&#1086;&#1076;&#1099; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1080;&#1081; (&#1087;&#1086; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1076;&#1085;&#1077;&#1081;) &#1087;&#1088;&#1080;&#1096;&#1083;&#1080;&#1089;&#1100; &#1085;&#1072; &#1086;&#1082;&#1090;&#1103;&#1073;&#1088;&#1100; 2025 &#1080; &#1085;&#1072;&#1095;&#1072;&#1083;&#1086; &#1103;&#1085;&#1074;&#1072;&#1088;&#1103; 2026. &#1053;&#1072;&#1076;&#1077;&#1102;&#1089;&#1100; &#1074;&#1089;&#1077; &#1085;&#1072;&#1082;&#1086;&#1085;&#1077;&#1094; &#1089;&#1086; &#1074;&#1089;&#1077;&#1084;&#1080; &#1076;&#1086;&#1075;&#1086;&#1074;&#1086;&#1088;&#1103;&#1090;&#1089;&#1103;. &#1042; &#1082;&#1072;&#1085;&#1072;&#1083;&#1077; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1082;&#1080; &#1076;&#1083;&#1103; &#1088;&#1086;&#1089;&#1089;&#1080;&#1081;&#1089;&#1082;&#1080;&#1093; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1077;&#1081; &#1103; &#1087;&#1088;&#1086;&#1096;&#1091; &#1080;&#1093; &#1080;&#1084;&#1077;&#1090;&#1100; &#1088;&#1077;&#1079;&#1077;&#1088;&#1074;&#1085;&#1099;&#1077; &#1082;&#1072;&#1085;&#1072;&#1083;&#1099; &#1080; &#1087;&#1088;&#1080;&#1074;&#1086;&#1078;&#1091; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1099; &#1089;&#1077;&#1088;&#1074;&#1080;&#1089;&#1086;&#1074;, &#1079;&#1072;&#1082;&#1088;&#1099;&#1074;&#1072;&#1102;&#1097;&#1080;&#1093; &#1095;&#1072;&#1089;&#1090;&#1100; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1086;&#1085;&#1072;&#1083;&#1072;. &#1050; &#1089;&#1086;&#1078;&#1072;&#1083;&#1077;&#1085;&#1080;&#1102;, &#1089;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1087;&#1086;&#1076;&#1086;&#1073;&#1085;&#1086;&#1075;&#1086; &#1073;&#1086;&#1090;&#1072; &#1074; &#1084;&#1077;&#1089;&#1089;&#1077;&#1085;&#1076;&#1078;&#1077;&#1088;&#1077; MAX &#1087;&#1086;&#1082;&#1072; &#1085;&#1077;&#1083;&#1100;&#1079;&#1103;, &#1090;&#1072;&#1082; &#1082;&#1072;&#1082; &#1085;&#1072; &#1076;&#1072;&#1085;&#1085;&#1099;&#1081; &#1084;&#1086;&#1084;&#1077;&#1085;&#1090; &#1089;&#1086;&#1079;&#1076;&#1072;&#1090;&#1077;&#1083;&#1077;&#1084; &#1073;&#1086;&#1090;&#1072; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1074;&#1077;&#1088;&#1080;&#1092;&#1080;&#1094;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1086;&#1077; &#1102;&#1088;&#1080;&#1076;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1077; &#1083;&#1080;&#1094;&#1086;.    </span>
</p>
<p   
><br/></p>
    </div>
    <div class="section section-1" id="src-22467087365_safe-id-aWQt0KbQuNGE0YDQvtCy0LDRj9C40L3QutC70Y7Qt9C40Y860LzQvtC50L3QtdCx0L7Qu9GM0YjQvtC50LLQutC70LDQtNC00LvRj9C70Y7QtNC10LnRgdGA0LXRh9C10LLRi9C80LjQuNGC0Y_QttC10LvRi9C80LjQvNC-0YLQvtGA0L3Ri9C80LjQvdCw0YDRg9GI0LXQvdC40Y_QvNC4LtCg0LDQt9GA0LDQsdC-0YLQutCw0L3QsNGB0YLRi9C60LXQmNCYLERJWSjRgdC00LXQu9Cw0LnRgdCw0Lwp0Y3Qu9C10LrRgtGA0L7QvdC40LrQuNC40L_RgNC40LrQu9Cw0LTQvdC-0LPQvtCf0J4uLUFibGVNb3VzZS3RgNC10YjQtdC90LjRj9C80L_QvtGD0L_RgNCw0LLQu9C10L3QuNGO0LzRi9GI0YzRjtC40LrQvtC80L_RjNGO0YLQtdGA0L7QvNC00LvRj9C70Y7QtNC10LnRgdGC0Y_QttGR0LvRi9C80LjRhNC40LfQuNGH0LXRgdC60LjQvNC40L7Qs9GA0LDQvdC40YfQtdC90LjRj9C80Lgs0L3QsNC_0YDQuNC80LXRgCzQv9Cw0YDQsNC70LjRh9GC0LXQu9Cw0Lg">
        <h1 class="heading heading-element"><span>AbleMouse - &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1103;&#1084; &#1087;&#1086; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1102; &#1084;&#1099;&#1096;&#1100;&#1102; &#1080; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1086;&#1084; &#1076;&#1083;&#1103; &#1083;&#1102;&#1076;&#1077;&#1081; &#1089; &#1090;&#1103;&#1078;&#1105;&#1083;&#1099;&#1084;&#1080; &#1092;&#1080;&#1079;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1084;&#1080; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1080;&#1103;&#1084;&#1080;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1087;&#1072;&#1088;&#1072;&#1083;&#1080;&#1095; &#1090;&#1077;&#1083;&#1072; &#1080; &#1075;&#1086;&#1083;&#1086;&#1074;&#1099;. </span></h1>
<p   
>&#1057;&#1077;&#1081;&#1095;&#1072;&#1089; AbleMouse &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1089;&#1086;&#1073;&#1086;&#1081; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1086;&#1090;&#1076;&#1077;&#1083;&#1100;&#1085;&#1099;&#1093; &#1087;&#1088;&#1086;&#1076;&#1091;&#1082;&#1090;&#1086;&#1074;, &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1085;&#1085;&#1099;&#1093; &#1076;&#1083;&#1103; &#1087;&#1086;&#1084;&#1086;&#1097;&#1080; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103;&#1084; &#1074; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1086;&#1090; &#1080;&#1093; &#1080;&#1085;&#1076;&#1080;&#1074;&#1080;&#1076;&#1091;&#1072;&#1083;&#1100;&#1085;&#1099;&#1093; &#1092;&#1080;&#1079;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1077;&#1081;. &#1053;&#1080;&#1078;&#1077; &#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1077;&#1085;&#1072; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1072;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1087;&#1086;&#1084;&#1086;&#1078;&#1077;&#1090; &#1089;&#1086;&#1088;&#1080;&#1077;&#1085;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1074; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099;&#1093; &#1074;&#1072;&#1088;&#1080;&#1072;&#1085;&#1090;&#1072;&#1093;.<br/><br/>&#1042;&#1089;&#1077; &#1087;&#1088;&#1086;&#1076;&#1091;&#1082;&#1090;&#1099; &#1089;&#1077;&#1088;&#1080;&#1080; &#1080;&#1084;&#1077;&#1102;&#1090; &#1087;&#1086;&#1083;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1099;&#1081; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1081; &#1082;&#1086;&#1076; &#1080; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1094;&#1080;&#1080; &#1087;&#1086; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1091; &#1080; &#1089;&#1073;&#1086;&#1088;&#1082;&#1077;.<br/>&#1057;&#1089;&#1099;&#1083;&#1082;&#1080; &#1085;&#1072; <strong class="Yjhzub ">GitHub</strong> &#1080; <strong class="Yjhzub ">Rutube</strong> &#1073;&#1091;&#1076;&#1091;&#1090; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099; &#1074; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1080; &#1082;&#1072;&#1078;&#1076;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1076;&#1091;&#1082;&#1090;&#1072;.</p>
<hr>
    <div class="section section-2" id="src-22467087365_safe-id-aWQt0KbQuNGE0YDQvtCy0LDRj9C40L3QutC70Y7Qt9C40Y860LzQvtC50L3QtdCx0L7Qu9GM0YjQvtC50LLQutC70LDQtNC00LvRj9C70Y7QtNC10LnRgdGA0LXRh9C10LLRi9C80LjQuNGC0Y_QttC10LvRi9C80LjQvNC-0YLQvtGA0L3Ri9C80LjQvdCw0YDRg9GI0LXQvdC40Y_QvNC4LtCg0LDQt9GA0LDQsdC-0YLQutCw0L3QsNGB0YLRi9C60LXQmNCYLERJWSjRgdC00LXQu9Cw0LnRgdCw0Lwp0Y3Qu9C10LrRgtGA0L7QvdC40LrQuNC40L_RgNC40LrQu9Cw0LTQvdC-0LPQvtCf0J4uLdCi0LDQsdC70LjRhtCw0L_RgNC-0LTRg9C60YLQvtCyQWJsZU1vdXNl">
        <h2 class="heading heading-element"><span>&#1058;&#1072;&#1073;&#1083;&#1080;&#1094;&#1072; &#1087;&#1088;&#1086;&#1076;&#1091;&#1082;&#1090;&#1086;&#1074; AbleMouse</span></h2>
<p   
><br/></p>
    <div  class="tablewrap">
        <table class="wrapped relative-table confluenceTable">
                    <colgroup>
                                    <col  width="8.79485%"/>
                                    <col  width="9.28279%"/>
                                    <col  width="28.719%"/>
                                    <col  width="44.1371%"/>
                                    <col  width="9.06629%"/>
                            </colgroup>
        <thead class=" ">    <tr>
            <td  class="confluenceTh" rowspan="1" colspan="1">
    <p   
>&#1053;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077; &#1087;&#1088;&#1086;&#1076;&#1091;&#1082;&#1090;&#1072;</p>
            </td>
                <td  class="confluenceTh" rowspan="1" colspan="1">
    <p   
>&#1050;&#1072;&#1082;&#1080;&#1077; &#1090;&#1088;&#1091;&#1076;&#1085;&#1086;&#1089;&#1090;&#1080; &#1080;&#1089;&#1087;&#1099;&#1090;&#1099;&#1074;&#1072;&#1077;&#1090; &#1095;&#1077;&#1083;&#1086;&#1074;&#1077;&#1082;</p>
            </td>
                <td  class="confluenceTh" rowspan="1" colspan="1">
    <p   
>&#1063;&#1090;&#1086; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1086; &#1095;&#1077;&#1083;&#1086;&#1074;&#1077;&#1082;&#1091; (&#1082;&#1072;&#1082;&#1091;&#1102; &#1095;&#1072;&#1089;&#1090;&#1100; &#1090;&#1077;&#1083;&#1072; &#1084;&#1086;&#1078;&#1077;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;)</p>
            </td>
                <td  class="confluenceTh" rowspan="1" colspan="1">
    <p   
>&#1054;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077;</p>
            </td>
                <td  class="confluenceTh" rowspan="1" colspan="1">
    <p   
>&#1057;&#1086;&#1074;&#1084;&#1077;&#1089;&#1090;&#1080;&#1084;&#1099;&#1077; &#1054;&#1057;</p>
            </td>
        </tr>
</thead><tfoot class=" "></tfoot><tbody class=" ">    <tr>
            <td  class="confluenceTd" rowspan="1" colspan="1">
    <p   
><strong class=" ">AbleMouse Beyond Switch Edition</strong></p>
            </td>
                <td  class="confluenceTd" rowspan="1" colspan="1">
    <p   
>&#1055;&#1086;&#1083;&#1085;&#1072;&#1103; &#1085;&#1077;&#1087;&#1086;&#1076;&#1074;&#1080;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1090;&#1077;&#1083;&#1072; &#1080; &#1075;&#1086;&#1083;&#1086;&#1074;&#1099;</p>
            </td>
                <td  class="confluenceTd" rowspan="1" colspan="1">
    <p   
>&#1042;&#1072;&#1088;&#1080;&#1072;&#1085;&#1090;&#1099;:<br/><br/>1. &#1055;&#1088;&#1080;&#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1100; &#1088;&#1086;&#1090;. &#1055;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1100;&#1090;&#1077; &#1095;&#1077;&#1083;&#1086;&#1074;&#1077;&#1082;&#1072;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1087;&#1086;&#1083;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102; &#1087;&#1072;&#1088;&#1072;&#1083;&#1080;&#1079;&#1086;&#1074;&#1072;&#1085; (&#1080; &#1090;&#1077;&#1083;&#1086;, &#1080; &#1075;&#1086;&#1083;&#1086;&#1074;&#1072;) &#1080; &#1087;&#1088;&#1080; &#1101;&#1090;&#1086;&#1084; &#1053;&#1045; &#1084;&#1086;&#1078;&#1077;&#1090; &#1075;&#1086;&#1074;&#1086;&#1088;&#1080;&#1090;&#1100;. &#1042; &#1082;&#1086;&#1085;&#1082;&#1088;&#1077;&#1090;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;, &#1086; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1084; &#1103; &#1075;&#1086;&#1074;&#1086;&#1088;&#1102;, &#1095;&#1077;&#1083;&#1086;&#1074;&#1077;&#1082;&#1091; &#1073;&#1099;&#1083;&#1086; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1086; &#1083;&#1080;&#1096;&#1100; &#1086;&#1076;&#1085;&#1086; <strong class=" ">&#1084;&#1080;&#1082;&#1088;&#1086;&#1076;&#1074;&#1080;&#1078;&#1077;&#1085;&#1080;&#1077;</strong> &mdash; &#1086;&#1085; &#1084;&#1086;&#1075; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1089;&#1083;&#1077;&#1075;&#1082;&#1072; &#1087;&#1088;&#1080;&#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1100; &#1088;&#1086;&#1090;.<br/><br/><strong class=" ">&#1048;&#1051;&#1048;</strong><br/><br/>2. &#1083;&#1102;&#1073;&#1086;&#1077; &#1076;&#1088;&#1091;&#1075;&#1086;&#1077; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1086;&#1077; &#1095;&#1077;&#1083;&#1086;&#1074;&#1077;&#1082;&#1091; &#1084;&#1080;&#1082;&#1088;&#1086;&#1076;&#1074;&#1080;&#1078;&#1077;&#1085;&#1080;&#1077;.     <span style="color: #0a0a0a;">
&#1057;&#1077;&#1081;&#1095;&#1072;&#1089; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072; &#1095;&#1077;&#1088;&#1077;&#1079; &#1074;&#1077;&#1073;-&#1082;&#1072;&#1084;&#1077;&#1088;&#1091; &#1092;&#1080;&#1082;&#1089;&#1080;&#1088;&#1091;&#1077;&#1090; &#1076;&#1074;&#1080;&#1078;&#1077;&#1085;&#1080;&#1103; &#1088;&#1090;&#1072;, &#1085;&#1086; &#1073;&#1083;&#1072;&#1075;&#1086;&#1076;&#1072;&#1088;&#1103; &#1072;&#1088;&#1093;&#1080;&#1090;&#1077;&#1082;&#1090;&#1091;&#1088;&#1077; (&#1087;&#1088;&#1086;&#1090;&#1086;&#1082;&#1086;&#1083; TCP) &#1084;&#1086;&#1078;&#1085;&#1086; &#1087;&#1086;&#1076;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100;     </span>
<strong class="Yjhzub ">&#1083;&#1102;&#1073;&#1086;&#1081; &#1076;&#1072;&#1090;&#1095;&#1080;&#1082; &#1080;&#1083;&#1080; &#1089;&#1077;&#1085;&#1089;&#1086;&#1088;</strong>    <span style="color: #0a0a0a;">
.<br/><br/>&#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1089;&#1077;&#1081;&#1095;&#1072;&#1089; &#1103; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1102; &#1085;&#1072;&#1076; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1086;&#1084;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1095;&#1077;&#1083;&#1086;&#1074;&#1077;&#1082; &#1072;&#1073;&#1089;&#1086;&#1083;&#1102;&#1090;&#1085;&#1086; &#1087;&#1072;&#1088;&#1072;&#1083;&#1080;&#1079;&#1086;&#1074;&#1072;&#1085; &#1080; &#1076;&#1072;&#1078;&#1077; &#1083;&#1080;&#1094;&#1086; &#1085;&#1077;&#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086; &#1079;&#1072;&#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1090;&#1100; &#1076;&#1083;&#1103; &#1082;&#1086;&#1085;&#1090;&#1088;&#1086;&#1083;&#1103; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1072;. &#1055;&#1083;&#1072;&#1085;&#1080;&#1088;&#1091;&#1077;&#1084;&#1086;&#1077; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1077; &#1085;&#1077; &#1086;&#1089;&#1085;&#1086;&#1074;&#1072;&#1085;&#1086; &#1085;&#1072; &#1089;&#1095;&#1080;&#1090;&#1099;&#1074;&#1072;&#1085;&#1080;&#1080; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1086;&#1074; &#1084;&#1086;&#1079;&#1075;&#1072;, &#1072; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090; &#1076;&#1088;&#1091;&#1075;&#1086;&#1081; &#1087;&#1086;&#1076;&#1093;&#1086;&#1076; (&#1087;&#1086;&#1082;&#1072; &#1089;&#1091;&#1090;&#1100; &#1087;&#1086;&#1076;&#1093;&#1086;&#1076;&#1072; &#1088;&#1072;&#1089;&#1082;&#1088;&#1099;&#1074;&#1072;&#1090;&#1100; &#1085;&#1077; &#1073;&#1091;&#1076;&#1091; &mdash; &#1093;&#1086;&#1095;&#1091; &#1089;&#1085;&#1072;&#1095;&#1072;&#1083;&#1072; &#1091;&#1073;&#1077;&#1076;&#1080;&#1090;&#1100;&#1089;&#1103;, &#1095;&#1090;&#1086; &#1074;&#1089;&#1105; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1077;&#1090;).    </span>
</p>
            </td>
                <td  class="confluenceTd" rowspan="1" colspan="1">
    <p   
>&#1055;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1090;&#1100;, &#1084;&#1099;&#1096;&#1100;&#1102;, &#1082;&#1083;&#1072;&#1074;&#1080;&#1072;&#1090;&#1091;&#1088;&#1086;&#1081; &#1080; &#1074; &#1094;&#1077;&#1083;&#1086;&#1084; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1086;&#1084;.     <span style="color: #0a0a0a;">
&#1055;&#1086; &#1089;&#1091;&#1090;&#1080;,     </span>
<strong class="Yjhzub ">&#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1080;&#1074;&#1072;&#1103; &#1075;&#1086;&#1083;&#1086;&#1089;&#1086;&#1074;&#1086;&#1081; &#1082;&#1086;&#1085;&#1090;&#1088;&#1086;&#1083;&#1100; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1072;</strong>    <span style="color: #0a0a0a;">
 <strong class=" ">&#1076;&#1072;&#1078;&#1077; &#1076;&#1083;&#1103; &#1083;&#1102;&#1076;&#1077;&#1081; &#1073;&#1077;&#1079; &#1075;&#1086;&#1083;&#1086;&#1089;&#1072; &#1080; &#1087;&#1088;&#1080; &#1087;&#1086;&#1083;&#1085;&#1086;&#1084; &#1087;&#1072;&#1088;&#1072;&#1083;&#1080;&#1095;&#1077;</strong>.     <span style="color: #1f2328;">
&#1069;&#1090;&#1086; &#1073;&#1086;&#1083;&#1077;&#1077; &#1077;&#1089;&#1090;&#1077;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1081; &#1080; &#1075;&#1080;&#1073;&#1082;&#1080;&#1081; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073; &#1074; &#1086;&#1090;&#1083;&#1080;&#1095;&#1080;&#1080; &#1086;&#1090; &#1090;&#1088;&#1072;&#1076;&#1080;&#1094;&#1080;&#1086;&#1085;&#1085;&#1099;&#1093; switch control &#1087;&#1086;&#1076;&#1093;&#1086;&#1076;&#1086;&#1074; &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1093; &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088; &#1074; Mac OS    </span>
    </span>
<br/><br/>    <span style="color: #0a0a0a;">
&#128248;    </span>
:<br/><img  class="confluence-embedded-image confluence-thumbnail"  src="media/article/ambs_demo_s_shot_numbers-version-1-modificationdate-1769587018629-api-v2.png" alt="media/article/ambs_demo_s_shot_numbers-version-1-modificationdate-1769587018629-api-v2.png"  height="150" />
<img  class="confluence-embedded-image confluence-thumbnail"  src="media/article/ambs_demo_s_shot_keyb-version-1-modificationdate-1769587028319-api-v2.png" alt="media/article/ambs_demo_s_shot_keyb-version-1-modificationdate-1769587028319-api-v2.png"  height="150" />
</p>
<p   
><br/></p>
<p   
><strong class="Yjhzub ">&#1055;&#1086;&#1076;&#1088;&#1086;&#1073;&#1085;&#1086;&#1089;&#1090;&#1080; (&#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077;, &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1094;&#1080;&#1080;, &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1081; &#1082;&#1086;&#1076; &#1080; &#1074;&#1080;&#1076;&#1077;&#1086;) </strong><br/>&#127479;&#127482; <strong class="Yjhzub ">RU:</strong> <a  class="external-link" href="https://github.com/aradzhabov/AbleMouse/blob/main/AbleMouse_Beyond_Switch_edition.ru.md">&#128230; GitHub + &#127916; Rutube</a><br/>&#127482;&#127480; <strong class="Yjhzub ">EN:</strong> <a  class="external-link" href="https://github.com/aradzhabov/AbleMouse/blob/main/AbleMouse_Beyond_Switch_edition.md">&#128230; GitHub + &#127916; Youtube</a></p>
            </td>
                <td  class="confluenceTd" rowspan="1" colspan="1">
    <p   
>Windows / &#1087;&#1086;&#1090;&#1077;&#1085;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1086; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1072; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072; &#1085;&#1072; macOS (&#1085;&#1091;&#1078;&#1085;&#1086; &#1090;&#1077;&#1089;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100;)</p>
            </td>
        </tr>
    <tr>
            <td  class="confluenceTd" rowspan="1" colspan="1">
    <p   
><strong class=" ">AbleMouse AI Edition</strong></p>
            </td>
                <td  class="confluenceTd" rowspan="1" colspan="1">
    <p   
>&#1055;&#1086;&#1083;&#1085;&#1072;&#1103; &#1085;&#1077;&#1087;&#1086;&#1076;&#1074;&#1080;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1090;&#1077;&#1083;&#1072;</p>
            </td>
                <td  class="confluenceTd" rowspan="1" colspan="1">
    <p   
>&#1052;&#1086;&#1078;&#1077;&#1090; &#1087;&#1086;&#1074;&#1086;&#1088;&#1072;&#1095;&#1080;&#1074;&#1072;&#1090;&#1100; &#1080; &#1086;&#1087;&#1091;&#1089;&#1082;&#1072;&#1090;&#1100;/&#1087;&#1086;&#1076;&#1085;&#1080;&#1084;&#1072;&#1090;&#1100; &#1075;&#1086;&#1083;&#1086;&#1074;&#1091;; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1086;&#1085;&#1080;&#1088;&#1091;&#1102;&#1090; &#1075;&#1083;&#1072;&#1079;&#1072; &#1080;&#1083;&#1080; &#1088;&#1086;&#1090;</p>
            </td>
                <td  class="confluenceTd" rowspan="1" colspan="1">
    <p   
>&#1042; &#1090;&#1086;&#1095;&#1082;&#1091; &#1087;&#1086; &#1085;&#1072;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1102;, &#1082;&#1091;&#1076;&#1072; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090; &#1085;&#1086;&#1089;, &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1086;&#1085;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1082;&#1091;&#1088;&#1089;&#1086;&#1088;, &#1072; &#1082;&#1083;&#1080;&#1082;&#1080; &#1076;&#1077;&#1083;&#1072;&#1102;&#1090;&#1089;&#1103; &#1075;&#1083;&#1072;&#1079;&#1072;&#1084;&#1080; &#1080; &#1088;&#1090;&#1086;&#1084;. &#1058;&#1091;&#1090; &#1074;&#1072;&#1078;&#1085;&#1086;, &#1095;&#1090;&#1086; &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1086;&#1085;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1087;&#1088;&#1086;&#1080;&#1089;&#1093;&#1086;&#1076;&#1080;&#1090; &#1080;&#1084;&#1077;&#1085;&#1085;&#1086; &#1087;&#1086; &#1085;&#1072;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1102;, &#1090;.&#1077;. &#1101;&#1082;&#1088;&#1072;&#1085; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1086;&#1095;&#1077;&#1085;&#1100; &#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1084;, &#1085;&#1086; &#1095;&#1077;&#1083;&#1086;&#1074;&#1077;&#1082;&#1091; &#1085;&#1080;&#1082;&#1091;&#1076;&#1072; &#1085;&#1077; &#1085;&#1091;&#1078;&#1085;&#1086; &#1076;&#1074;&#1080;&#1075;&#1072;&#1090;&#1100;&#1089;&#1103; &mdash; &#1085;&#1091;&#1078;&#1085;&#1086; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1085;&#1072;&#1087;&#1088;&#1072;&#1074;&#1080;&#1090;&#1100; &#1085;&#1086;&#1089; &#1074; &#1090;&#1086;&#1095;&#1082;&#1091;, &#1082;&#1091;&#1076;&#1072; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1089;&#1090;&#1080;&#1090;&#1100; &#1082;&#1091;&#1088;&#1089;&#1086;&#1088;.<br/><br/>    <span style="color: #0a0a0a;">
&#128248;    </span>
:<br/><img  class="confluence-embedded-image confluence-thumbnail"  src="media/article/ablemouse_ai_icon-version-1-modificationdate-1769618470779-api-v2.jpg" alt="media/article/ablemouse_ai_icon-version-1-modificationdate-1769618470779-api-v2.jpg"  height="150" />
<img  class="confluence-embedded-image confluence-thumbnail"  src="media/article/ablemouse_ai_screenshot-version-1-modificationdate-1769618481309-api-v2.jpg" alt="media/article/ablemouse_ai_screenshot-version-1-modificationdate-1769618481309-api-v2.jpg"  height="150" />
</p>
<p   
><br/></p>
<p   
><strong class="Yjhzub ">&#1055;&#1086;&#1076;&#1088;&#1086;&#1073;&#1085;&#1086;&#1089;&#1090;&#1080; (&#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077;, &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1094;&#1080;&#1080;, &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1081; &#1082;&#1086;&#1076; &#1080; &#1074;&#1080;&#1076;&#1077;&#1086;) </strong><br/>&#127479;&#127482; <strong class="Yjhzub ">RU:</strong> <a  class="external-link" href="https://github.com/aradzhabov/AbleMouse/blob/main/AbleMouse_AI_edition.ru.md">&#128230; GitHub + &#127916; Rutube</a><br/>&#127482;&#127480; <strong class="Yjhzub ">EN:</strong> <a  class="external-link" href="https://github.com/aradzhabov/AbleMouse/blob/main/AbleMouse_AI_edition.md">&#128230; GitHub + &#127916; Youtube</a></p>
<p   
><br/></p>
            </td>
                <td  class="confluenceTd" rowspan="1" colspan="1">
    <p   
>Windows / macOS / &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1082;&#1072; Unix/Ubuntu &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1072; &mdash; &#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1090;&#1089;&#1103; &#1090;&#1077;&#1089;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;</p>
            </td>
        </tr>
    <tr>
            <td  class="confluenceTd" rowspan="1" colspan="1">
    <p   
><strong class=" ">AbleMouse DIY Edition</strong></p>
            </td>
                <td  class="confluenceTd" rowspan="1" colspan="1">
    <p   
>&#1042;&#1072;&#1088;&#1080;&#1072;&#1085;&#1090;&#1099;:<br/><br/>1. &#1055;&#1086;&#1083;&#1085;&#1072;&#1103; &#1085;&#1077;&#1087;&#1086;&#1076;&#1074;&#1080;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100;<br/>&#1090;&#1077;&#1083;&#1072; &#1080; &#1075;&#1086;&#1083;&#1086;&#1074;&#1099;</p>
<p   
><strong class=" "><br/>&#1048;&#1051;&#1048;</strong></p>
<p   
><br/></p>
<p   
><strong class=" ">2. </strong>&#1055;&#1083;&#1086;&#1093;&#1086; &#1082;&#1086;&#1085;&#1090;&#1088;&#1086;&#1083;&#1080;&#1088;&#1091;&#1077;&#1090; &#1075;&#1086;&#1083;&#1086;&#1074;&#1091; (&#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1087;&#1088;&#1080; &#1044;&#1062;&#1055;)</p>
            </td>
                <td  class="confluenceTd" rowspan="1" colspan="1">
    <p   
>&#1042;&#1072;&#1088;&#1080;&#1072;&#1085;&#1090;&#1099;:<br/><br/></p>
<ol class=" "><li class=" "><p   
>&#1052;&#1086;&#1078;&#1077;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1103;&#1079;&#1099;&#1082;</p>
</li></ol><p   
><br/></p>
<p   
><strong class=" "><br/>&#1048;&#1051;&#1048;</strong></p>
<p   
><br/></p>
<p   
>2. &#1052;&#1086;&#1078;&#1077;&#1090; &#1076;&#1074;&#1080;&#1075;&#1072;&#1090;&#1100; &#1076;&#1088;&#1091;&#1075;&#1080;&#1084;&#1080; &#1095;&#1072;&#1089;&#1090;&#1103;&#1084;&#1080; &#1090;&#1077;&#1083;&#1072; (&#1076;&#1072;&#1078;&#1077; &#1085;&#1077; &#1086;&#1095;&#1077;&#1085;&#1100; &#1083;&#1086;&#1074;&#1082;&#1086;). &#1055;&#1086; &#1089;&#1091;&#1090;&#1080; &#1101;&#1090;&#1086; &#1074;&#1090;&#1086;&#1088;&#1072;&#1103; &#1074;&#1072;&#1088;&#1080;&#1072;&#1094;&#1080;&#1103; AbleMouse DIY Edition, &#1085;&#1086; &#1076;&#1083;&#1103; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1084;&#1099;&#1096;&#1082;&#1086;&#1081; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1085;&#1077; &#1103;&#1079;&#1099;&#1082;, &#1072; &#1089;&#1087;&#1077;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &#1087;&#1077;&#1076;&#1072;&#1083;&#1100;&#1082;&#1080;, &#1088;&#1072;&#1079;&#1084;&#1077;&#1097;&#1105;&#1085;&#1085;&#1099;&#1077; &#1074; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099;&#1093; &#1095;&#1077;&#1083;&#1086;&#1074;&#1077;&#1082;&#1091; &#1084;&#1077;&#1089;&#1090;&#1072;&#1093;</p>
<p   
><br/></p>
            </td>
                <td  class="confluenceTd" rowspan="1" colspan="1">
    <p   
>&#1042;&#1072;&#1088;&#1080;&#1072;&#1085;&#1090;&#1099; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;:<br/>1. &#1071;&#1079;&#1099;&#1082; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1076;&#1083;&#1103; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1082;&#1091;&#1088;&#1089;&#1086;&#1088;&#1086;&#1084; &#1080; &#1089;&#1086;&#1074;&#1077;&#1088;&#1096;&#1077;&#1085;&#1080;&#1103; &#1082;&#1083;&#1080;&#1082;&#1086;&#1074;<br/><strong class=" ">&#1048;&#1051;&#1048;</strong><br/>2. &#1059;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1082;&#1091;&#1088;&#1089;&#1086;&#1088;&#1086;&#1084; &#1080; &#1101;&#1084;&#1091;&#1083;&#1103;&#1094;&#1080;&#1103; &#1082;&#1083;&#1080;&#1082;&#1086;&#1074; &#1086;&#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103; &#1095;&#1077;&#1088;&#1077;&#1079; &#1085;&#1072;&#1078;&#1072;&#1090;&#1080;&#1077; &#1087;&#1077;&#1076;&#1072;&#1083;&#1077;&#1081;. &#1043;&#1080;&#1073;&#1082;&#1072;&#1103; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1072; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;-&#1072;&#1087;&#1087;&#1072;&#1088;&#1072;&#1090;&#1085;&#1086;&#1075;&#1086; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1089;&#1072; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1072;&#1076;&#1072;&#1087;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1091; &#1087;&#1086;&#1076; &#1080;&#1085;&#1076;&#1080;&#1074;&#1080;&#1076;&#1091;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &#1086;&#1089;&#1086;&#1073;&#1077;&#1085;&#1085;&#1086;&#1089;&#1090;&#1080;: &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; &#1092;&#1080;&#1083;&#1100;&#1090;&#1088; &#1076;&#1083;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1080; &#1085;&#1072;&#1078;&#1072;&#1090;&#1080;&#1103;, &#1077;&#1089;&#1083;&#1080; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1102; &#1090;&#1088;&#1091;&#1076;&#1085;&#1086; &#1073;&#1099;&#1089;&#1090;&#1088;&#1086; &#1086;&#1090;&#1087;&#1091;&#1089;&#1090;&#1080;&#1090;&#1100; &#1087;&#1077;&#1076;&#1072;&#1083;&#1100;<br/><br/>    <span style="color: #0a0a0a;">
&#128248;    </span>
:<br/><img  class="confluence-embedded-image confluence-thumbnail"  src="media/article/ablemouse_diy-version-1-modificationdate-1769619208874-api-v2.jpg" alt="media/article/ablemouse_diy-version-1-modificationdate-1769619208874-api-v2.jpg"  height="150" />
<img  class="confluence-embedded-image confluence-thumbnail"  src="media/article/ablemouse_diy_box-version-1-modificationdate-1769619635925-api-v2.png" alt="media/article/ablemouse_diy_box-version-1-modificationdate-1769619635925-api-v2.png"  height="150" />
<img  class="confluence-embedded-image"  src="media/article/ablemouse_diy_box_base-version-1-modificationdate-1769619636402-api-v2.png" alt="images/download/attachments/22467087365/ablemouse_diy_box_base-version-1-modificationdate-1769619636402-api-v2.png"  height="150" />
</p>
<p   
><br/></p>
<p   
><strong class="Yjhzub ">&#1055;&#1086;&#1076;&#1088;&#1086;&#1073;&#1085;&#1086;&#1089;&#1090;&#1080; (&#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077;, &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1094;&#1080;&#1080;, &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1081; &#1082;&#1086;&#1076; &#1080; &#1074;&#1080;&#1076;&#1077;&#1086;) </strong><br/>&#127479;&#127482; <strong class="Yjhzub ">RU:</strong> <a  class="external-link" href="https://github.com/aradzhabov/AbleMouse/blob/main/AbleMouseDIY.ru.md">&#128230; GitHub + &#127916; Rutube</a><br/>&#127482;&#127480; <strong class="Yjhzub ">EN:</strong> <a  class="external-link" href="https://github.com/aradzhabov/AbleMouse/blob/main/AbleMouseDIY.md">&#128230; GitHub + &#127916; Youtube</a></p>
<p   
><br/></p>
            </td>
                <td  class="confluenceTd" rowspan="1" colspan="1">
    <p   
>Windows, macOS, iOS, iPadOS, Unix (Ubuntu), Android</p>
            </td>
        </tr>
    <tr>
            <td  class="confluenceTd" rowspan="1" colspan="1">
    <p   
><strong class=" ">AbleMouse MouseCommander</strong></p>
            </td>
                <td  class="confluenceTd" rowspan="1" colspan="1">
    <p   
>-</p>
            </td>
                <td  class="confluenceTd" rowspan="1" colspan="1">
    <p   
>-</p>
            </td>
                <td  class="confluenceTd" rowspan="1" colspan="1">
    <p   
>&#1052;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085; &#1089;&#1086;&#1074;&#1084;&#1077;&#1089;&#1090;&#1085;&#1086; &#1089; DIY Edition &#1080; AI Edition. &#1055;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1100;&#1090;&#1077; &#1089;&#1080;&#1090;&#1091;&#1072;&#1094;&#1080;&#1102;: &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1090;&#1100; &#1082;&#1091;&#1088;&#1089;&#1086;&#1088;&#1086;&#1084;, &#1085;&#1086; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1085;&#1077;&#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1085;&#1099;&#1084;&#1080; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1072;&#1084;&#1080; (&#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1075;&#1083;&#1072;&#1079;) &mdash; &#1041;&#1045;&#1047; &#1082;&#1083;&#1072;&#1089;&#1089;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1081; &#1084;&#1099;&#1096;&#1080;, &#1082;&#1083;&#1072;&#1074;&#1080;&#1072;&#1090;&#1091;&#1088;&#1099; &#1080; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1087;&#1088;&#1080;&#1074;&#1099;&#1095;&#1085;&#1099;&#1093; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074; &#1074;&#1074;&#1086;&#1076;&#1072;. &#1042;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1085;&#1099;&#1077; &#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1072; Windows &#1074; &#1090;&#1072;&#1082;&#1080;&#1093; &#1091;&#1089;&#1083;&#1086;&#1074;&#1080;&#1103;&#1093; &#1086;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1085;&#1077; &#1089;&#1083;&#1080;&#1096;&#1082;&#1086;&#1084; &#1091;&#1076;&#1086;&#1073;&#1085;&#1099;&#1084;&#1080;. &#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1089;&#1090;&#1080;&#1090;&#1100; &#1082;&#1091;&#1088;&#1089;&#1086;&#1088; &#1080;&#1079; &#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1091;&#1075;&#1083;&#1072; &#1101;&#1082;&#1088;&#1072;&#1085;&#1072; &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1086;&#1087;&#1086;&#1083;&#1086;&#1078;&#1085;&#1099;&#1081;, &#1074;&#1072;&#1084; &#1074;&#1089;&#1105; &#1088;&#1072;&#1074;&#1085;&#1086; &#1087;&#1088;&#1080;&#1076;&#1105;&#1090;&#1089;&#1103; &quot;&#1074;&#1077;&#1089;&#1090;&#1080;&quot; &#1077;&#1075;&#1086; &#1087;&#1086; &#1074;&#1089;&#1077;&#1084;&#1091; &#1087;&#1091;&#1090;&#1080; &mdash; &#1073;&#1099;&#1089;&#1090;&#1088;&#1086;&#1075;&#1086; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1072; &quot;&#1090;&#1077;&#1083;&#1077;&#1087;&#1086;&#1088;&#1090;&#1072;&#1094;&#1080;&#1080;&quot; &#1082;&#1091;&#1088;&#1089;&#1086;&#1088;&#1072; &#1085;&#1077;&#1090;. &#1055;&#1088;&#1080; &#1101;&#1090;&#1086;&#1084; &#1074; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1077; &#1077;&#1089;&#1090;&#1100; &#1084;&#1085;&#1086;&#1078;&#1077;&#1089;&#1090;&#1074;&#1086; &#1087;&#1086;&#1083;&#1077;&#1079;&#1085;&#1099;&#1093; &#1089;&#1086;&#1095;&#1077;&#1090;&#1072;&#1085;&#1080;&#1081; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096; &#1080; &#1074;&#1089;&#1087;&#1086;&#1084;&#1086;&#1075;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1093; &#1091;&#1090;&#1080;&#1083;&#1080;&#1090;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1084;&#1086;&#1075;&#1083;&#1080; &#1073;&#1099; &#1079;&#1085;&#1072;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1091;&#1087;&#1088;&#1086;&#1089;&#1090;&#1080;&#1090;&#1100; &#1079;&#1072;&#1076;&#1072;&#1095;&#1091;. &#1053;&#1086; &#1082;&#1072;&#1082; &#1080;&#1093; &#1074;&#1099;&#1079;&#1074;&#1072;&#1090;&#1100;, &#1077;&#1089;&#1083;&#1080; &#1074;&#1099; &#1085;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1082;&#1083;&#1072;&#1074;&#1080;&#1072;&#1090;&#1091;&#1088;&#1091; &#1080;&#1083;&#1080; &#1076;&#1088;&#1091;&#1075;&#1080;&#1077; &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1085;&#1099;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; &#1074;&#1074;&#1086;&#1076;&#1072;? MouseCommander &#1088;&#1077;&#1096;&#1072;&#1077;&#1090; &#1101;&#1090;&#1091; &#1079;&#1072;&#1076;&#1072;&#1095;&#1091;.<br/><br/><img  class="confluence-embedded-image confluence-thumbnail"  src="media/article/MouseCommander_baner-version-1-modificationdate-1769709265456-api-v2.jpg" alt="media/article/MouseCommander_baner-version-1-modificationdate-1769709265456-api-v2.jpg"  height="150" />
    </p>
<p   
><strong class="Yjhzub ">&#1055;&#1086;&#1076;&#1088;&#1086;&#1073;&#1085;&#1086;&#1089;&#1090;&#1080; (&#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077;, &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1094;&#1080;&#1080;, &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1081; &#1082;&#1086;&#1076; &#1080; &#1074;&#1080;&#1076;&#1077;&#1086;) </strong><br/>&#127479;&#127482; <strong class="Yjhzub ">RU:</strong> <a  class="external-link" href="https://github.com/aradzhabov/AbleMouse/blob/main/src/windows/auto_hot_key/README.ru.md">&#128230; GitHub + &#127916; Rutube</a><br/>&#127482;&#127480; <strong class="Yjhzub ">EN:</strong> <a  class="external-link" href="https://github.com/aradzhabov/AbleMouse/blob/main/src/windows/auto_hot_key/README.md">&#128230; GitHub + &#127916; Youtube</a></p>
<p   
><br/></p>
            </td>
                <td  class="confluenceTd" rowspan="1" colspan="1">
    <p   
>Windows</p>
            </td>
        </tr>
</tbody>        </table>
            </div>
<p   
><br/>p.s.<br/>&#1059; &#1084;&#1077;&#1085;&#1103; &#1077;&#1089;&#1090;&#1100; &#1089;&#1074;&#1086;&#1081; &#1085;&#1077;&#1073;&#1086;&#1083;&#1100;&#1096;&#1086;&#1081; &#1090;&#1077;&#1083;&#1077;&#1075;&#1088;&#1072;&#1084;-&#1082;&#1072;&#1085;&#1072;&#1083; <a  class="external-link" href="https://t.me/gagarin_data_labs/123">https://t.me/gagarin_data_labs</a>, &#1075;&#1076;&#1077; &#1103; &#1087;&#1086; &#1084;&#1077;&#1088;&#1077; &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080; &#1080;&#1076;&#1077;&#1081; &#1087;&#1091;&#1073;&#1083;&#1080;&#1082;&#1091;&#1102; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1102;. &#1058;&#1072;&#1084; &#1084;&#1086;&#1078;&#1085;&#1086; &#1085;&#1072;&#1081;&#1090;&#1080; &#1080;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089;&#1085;&#1099;&#1077; &#1080;&#1089;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; (R&amp;D),<br/>&#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1087;&#1086; &#1088;&#1072;&#1089;&#1087;&#1086;&#1079;&#1085;&#1072;&#1074;&#1072;&#1085;&#1080;&#1102; &#1088;&#1077;&#1095;&#1080; &#1087;&#1086; &#1075;&#1091;&#1073;&#1072;&#1084; &#1080;&#1083;&#1080; &#1087;&#1086;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1102; &#1090;&#1086;&#1075;&#1086;, &#1095;&#1090;&#1086; &#1075;&#1086;&#1074;&#1086;&#1088;&#1080;&#1090; &#1095;&#1077;&#1083;&#1086;&#1074;&#1077;&#1082; &#1074; &#1086;&#1095;&#1077;&#1085;&#1100; &#1096;&#1091;&#1084;&#1085;&#1099;&#1093; &#1091;&#1089;&#1083;&#1086;&#1074;&#1080;&#1103;&#1093;, &#1072; &#1090;&#1072;&#1082;&#1078;&#1077; &#1084;&#1085;&#1086;&#1075;&#1086; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1101;&#1082;&#1089;&#1087;&#1077;&#1088;&#1080;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;.<br/><br/><br/></p>
    </div>
    </div>
        </div>

    </article>


            <nav id="ht-post-nav">
            </nav>    
            
    <footer id="ht-footer">
    <a href="#" id="ht-jump-top" class="sp-aui-icon-small sp-aui-iconfont-arrows-up"></a>
</footer></div>

<div>
    <div id="ht-mq-detect"></div>
</div>

    <script src="js/lunr.js"></script>
    <script src="js/lunr-extras.js"></script>
    <script src="assets/js/scroll-search.js"></script>

    <script src="assets/js/expand-macro.js"></script>
</body>
</html>
